# Introduction
This notebook performs the tasks in the exercise

In [1]:
%load_ext autoreload
%autoreload 2

In [47]:
from migrator import Migrator
from database import Database
from environs import Env
import tasks as t
import pandas as pd

## Part 1
Setting up and seeding the database.

In [3]:
env = Env()
env.read_env(".env")

In [72]:
database = Database(
    host=env.str("DB_HOST"),
    port=3307,
    user=env.str("DB_USER"),
    password=env.str("DB_PASSWORD"),
    database=env.str("DB_DATABASE")
)

Connected to: 8.1.0
You are connected to the database: ('mysql',)
-----------------------------------------------

### Create tables

In [33]:
migrator = Migrator(database, 2500)

In [34]:
migrator.migrate()

--------------------------------Starting migrate--------------------------------
Found migration files:  ['001_users.sql', '002_activities.sql', '003_trackpoints.sql']
Running migration:   001_users.sql       âœ…
Running migration:   002_activities.sql  âœ…
Running migration:   003_trackpoints.sql âœ…
-------------------------Finished migrate in 58.146 ms--------------------------

### (DANGER) Wipe the DB
ðŸš¨ THIS WILL WIPE ALL DATA IN THE TABLES ðŸš¨

In [32]:
migrator.wipe()

---------------------------------Starting wipe----------------------------------
Wiping TrackPoints
Wiping Activities
Wiping Users
--------------------------Finished wipe in 1134.808 ms--------------------------

### Seed Database from Data Set

In [35]:
migrator.seed_users()

------------------------------Starting seed_users-------------------------------
Seeded [(182,)] Users
------------------------Finished seed_users in 16.647 ms------------------------

In [36]:
migrator.seed_activities()

----------------------------Starting seed_activities----------------------------
Generating seed data for user: 135	âœ…
Generating seed data for user: 132	âœ…
Generating seed data for user: 104	âœ…
Generating seed data for user: 103	âœ…
Generating seed data for user: 168	âœ…
Generating seed data for user: 157	âœ…
Generating seed data for user: 150	âœ…
Generating seed data for user: 159	âœ…
Generating seed data for user: 166	âœ…
Generating seed data for user: 161	âœ…
Generating seed data for user: 102	âœ…
Generating seed data for user: 105	âœ…
Generating seed data for user: 133	âœ…
Generating seed data for user: 134	âœ…
Generating seed data for user: 160	âœ…
Generating seed data for user: 158	âœ…
Generating seed data for user: 167	âœ…
Generating seed data for user: 151	âœ…
Generating seed data for user: 169	âœ…
Generating seed data for user: 156	âœ…
Generating seed data for user: 024	âœ…
Generating seed data for user: 023	âœ…
Generating seed data for user: 015	âœ…
Generating seed data for user: 012	âœ…
Generating seed data for user: 079	âœ…
Generating seed data for user: 046	âœ…
Generating seed data for user: 041	âœ…
Generating seed data for user: 048	âœ…
Generating seed data for user: 077	âœ…
Generating seed data for user: 083	âœ…
Generating seed data for user: 084	âœ…
Generating seed data for user: 070	âœ…
Generating seed data for user: 013	âœ…
Generating seed data for user: 014	âœ…
Generating seed data for user: 022	âœ…
Generating seed data for user: 025	âœ…
Generating seed data for user: 071	âœ…
Generating seed data for user: 085	âœ…
Generating seed data for user: 049	âœ…
Generating seed data for user: 082	âœ…
Generating seed data for user: 076	âœ…
Generating seed data for user: 040	âœ…
Generating seed data for user: 078	âœ…
Generating seed data for user: 047	âœ…
Generating seed data for user: 065	âœ…
Generating seed data for user: 091	âœ…
Generating seed data for user: 096	âœ…
Generating seed data for user: 062	âœ…
Generating seed data for user: 054	âœ…
Generating seed data for user: 053	âœ…
Generating seed data for user: 098	âœ…
Generating seed data for user: 038	âœ…
Generating seed data for user: 007	âœ…
Generating seed data for user: 000	âœ…
Generating seed data for user: 009	âœ…
Generating seed data for user: 036	âœ…
Generating seed data for user: 031	âœ…
Generating seed data for user: 052	âœ…
Generating seed data for user: 099	âœ…
Generating seed data for user: 055	âœ…
Generating seed data for user: 063	âœ…
Generating seed data for user: 097	âœ…
Generating seed data for user: 090	âœ…
Generating seed data for user: 064	âœ…
Generating seed data for user: 030	âœ…
Generating seed data for user: 008	âœ…
Generating seed data for user: 037	âœ…
Generating seed data for user: 001	âœ…
Generating seed data for user: 039	âœ…
Generating seed data for user: 006	âœ…
Generating seed data for user: 174	âœ…
Generating seed data for user: 180	âœ…
Generating seed data for user: 173	âœ…
Generating seed data for user: 145	âœ…
Generating seed data for user: 142	âœ…
Generating seed data for user: 129	âœ…
Generating seed data for user: 116	âœ…
Generating seed data for user: 111	âœ…
Generating seed data for user: 118	âœ…
Generating seed data for user: 127	âœ…
Generating seed data for user: 120	âœ…
Generating seed data for user: 143	âœ…
Generating seed data for user: 144	âœ…
Generating seed data for user: 172	âœ…
Generating seed data for user: 181	âœ…
Generating seed data for user: 175	âœ…
Generating seed data for user: 121	âœ…
Generating seed data for user: 119	âœ…
Generating seed data for user: 126	âœ…
Generating seed data for user: 110	âœ…
Generating seed data for user: 128	âœ…
Generating seed data for user: 117	âœ…
Generating seed data for user: 153	âœ…
Generating seed data for user: 154	âœ…
Generating seed data for user: 162	âœ…
Generating seed data for user: 165	âœ…
Generating seed data for user: 131	âœ…
Generating seed data for user: 136	âœ…
Generating seed data for user: 109	âœ…
Generating seed data for user: 100	âœ…
Generating seed data for user: 107	âœ…
Generating seed data for user: 138	âœ…
Generating seed data for user: 164	âœ…
Generating seed data for user: 163	âœ…
Generating seed data for user: 155	âœ…
Generating seed data for user: 152	âœ…
Generating seed data for user: 106	âœ…
Generating seed data for user: 139	âœ…
Generating seed data for user: 101	âœ…
Generating seed data for user: 137	âœ…
Generating seed data for user: 108	âœ…
Generating seed data for user: 130	âœ…
Generating seed data for user: 089	âœ…
Generating seed data for user: 042	âœ…
Generating seed data for user: 045	âœ…
Generating seed data for user: 087	âœ…
Generating seed data for user: 073	âœ…
Generating seed data for user: 074	âœ…
Generating seed data for user: 080	âœ…
Generating seed data for user: 020	âœ…
Generating seed data for user: 027	âœ…
Generating seed data for user: 018	âœ…
Generating seed data for user: 011	âœ…
Generating seed data for user: 016	âœ…
Generating seed data for user: 029	âœ…
Generating seed data for user: 081	âœ…
Generating seed data for user: 075	âœ…
Generating seed data for user: 072	âœ…
Generating seed data for user: 086	âœ…
Generating seed data for user: 044	âœ…
Generating seed data for user: 088	âœ…
Generating seed data for user: 043	âœ…
Generating seed data for user: 017	âœ…
Generating seed data for user: 028	âœ…
Generating seed data for user: 010	âœ…
Generating seed data for user: 026	âœ…
Generating seed data for user: 019	âœ…
Generating seed data for user: 021	âœ…
Generating seed data for user: 003	âœ…
Generating seed data for user: 004	âœ…
Generating seed data for user: 032	âœ…
Generating seed data for user: 035	âœ…
Generating seed data for user: 095	âœ…
Generating seed data for user: 061	âœ…
Generating seed data for user: 066	âœ…
Generating seed data for user: 092	âœ…
Generating seed data for user: 059	âœ…
Generating seed data for user: 050	âœ…
Generating seed data for user: 057	âœ…
Generating seed data for user: 068	âœ…
Generating seed data for user: 034	âœ…
Generating seed data for user: 033	âœ…
Generating seed data for user: 005	âœ…
Generating seed data for user: 002	âœ…
Generating seed data for user: 056	âœ…
Generating seed data for user: 069	âœ…
Generating seed data for user: 051	âœ…
Generating seed data for user: 093	âœ…
Generating seed data for user: 067	âœ…
Generating seed data for user: 058	âœ…
Generating seed data for user: 060	âœ…
Generating seed data for user: 094	âœ…
Generating seed data for user: 112	âœ…
Generating seed data for user: 115	âœ…
Generating seed data for user: 123	âœ…
Generating seed data for user: 124	âœ…
Generating seed data for user: 170	âœ…
Generating seed data for user: 177	âœ…
Generating seed data for user: 148	âœ…
Generating seed data for user: 141	âœ…
Generating seed data for user: 146	âœ…
Generating seed data for user: 179	âœ…
Generating seed data for user: 125	âœ…
Generating seed data for user: 122	âœ…
Generating seed data for user: 114	âœ…
Generating seed data for user: 113	âœ…
Generating seed data for user: 147	âœ…
Generating seed data for user: 178	âœ…
Generating seed data for user: 140	âœ…
Generating seed data for user: 176	âœ…
Generating seed data for user: 149	âœ…
Generating seed data for user: 171	âœ…
Seeded 16048 Activities
--------------------Finished seed_activities in 22517.616 ms--------------------

In [37]:
migrator.seed_track_points()

---------------------------Starting seed_track_points---------------------------
Generating seed data for user: 135	âœ…
Generating seed data for user: 132	âœ…
Generating seed data for user: 104	âœ…
Generating seed data for user: 103	âœ…
Generating seed data for user: 168	âœ…
Generating seed data for user: 157	âœ…
Generating seed data for user: 150	âœ…
Generating seed data for user: 159	âœ…
Generating seed data for user: 166	âœ…
Generating seed data for user: 161	âœ…
Generating seed data for user: 102	âœ…
Generating seed data for user: 105	âœ…
Generating seed data for user: 133	âœ…
Generating seed data for user: 134	âœ…
Generating seed data for user: 160	âœ…
Generating seed data for user: 158	âœ…
Generating seed data for user: 167	âœ…
Generating seed data for user: 151	âœ…
Generating seed data for user: 169	âœ…
Generating seed data for user: 156	âœ…
Generating seed data for user: 024	âœ…
Generating seed data for user: 023	âœ…
Generating seed data for user: 015	âœ…
Generating seed data for user: 012	âœ…
Generating seed data for user: 079	âœ…
Generating seed data for user: 046	âœ…
Generating seed data for user: 041	âœ…
Generating seed data for user: 048	âœ…
Generating seed data for user: 077	âœ…
Generating seed data for user: 083	âœ…
Generating seed data for user: 084	âœ…
Generating seed data for user: 070	âœ…
Generating seed data for user: 013	âœ…
Generating seed data for user: 014	âœ…
Generating seed data for user: 022	âœ…
Generating seed data for user: 025	âœ…
Generating seed data for user: 071	âœ…
Generating seed data for user: 085	âœ…
Generating seed data for user: 049	âœ…
Generating seed data for user: 082	âœ…
Generating seed data for user: 076	âœ…
Generating seed data for user: 040	âœ…
Generating seed data for user: 078	âœ…
Generating seed data for user: 047	âœ…
Generating seed data for user: 065	âœ…
Generating seed data for user: 091	âœ…
Generating seed data for user: 096	âœ…
Generating seed data for user: 062	âœ…
Generating seed data for user: 054	âœ…
Generating seed data for user: 053	âœ…
Generating seed data for user: 098	âœ…
Generating seed data for user: 038	âœ…
Generating seed data for user: 007	âœ…
Generating seed data for user: 000	âœ…
Generating seed data for user: 009	âœ…
Generating seed data for user: 036	âœ…
Generating seed data for user: 031	âœ…
Generating seed data for user: 052	âœ…
Generating seed data for user: 099	âœ…
Generating seed data for user: 055	âœ…
Generating seed data for user: 063	âœ…
Generating seed data for user: 097	âœ…
Generating seed data for user: 090	âœ…
Generating seed data for user: 064	âœ…
Generating seed data for user: 030	âœ…
Generating seed data for user: 008	âœ…
Generating seed data for user: 037	âœ…
Generating seed data for user: 001	âœ…
Generating seed data for user: 039	âœ…
Generating seed data for user: 006	âœ…
Generating seed data for user: 174	âœ…
Generating seed data for user: 180	âœ…
Generating seed data for user: 173	âœ…
Generating seed data for user: 145	âœ…
Generating seed data for user: 142	âœ…
Generating seed data for user: 129	âœ…
Generating seed data for user: 116	âœ…
Generating seed data for user: 111	âœ…
Generating seed data for user: 118	âœ…
Generating seed data for user: 127	âœ…
Generating seed data for user: 120	âœ…
Generating seed data for user: 143	âœ…
Generating seed data for user: 144	âœ…
Generating seed data for user: 172	âœ…
Generating seed data for user: 181	âœ…
Generating seed data for user: 175	âœ…
Generating seed data for user: 121	âœ…
Generating seed data for user: 119	âœ…
Generating seed data for user: 126	âœ…
Generating seed data for user: 110	âœ…
Generating seed data for user: 128	âœ…
Generating seed data for user: 117	âœ…
Generating seed data for user: 153	âœ…
Generating seed data for user: 154	âœ…
Generating seed data for user: 162	âœ…
Generating seed data for user: 165	âœ…
Generating seed data for user: 131	âœ…
Generating seed data for user: 136	âœ…
Generating seed data for user: 109	âœ…
Generating seed data for user: 100	âœ…
Generating seed data for user: 107	âœ…
Generating seed data for user: 138	âœ…
Generating seed data for user: 164	âœ…
Generating seed data for user: 163	âœ…
Generating seed data for user: 155	âœ…
Generating seed data for user: 152	âœ…
Generating seed data for user: 106	âœ…
Generating seed data for user: 139	âœ…
Generating seed data for user: 101	âœ…
Generating seed data for user: 137	âœ…
Generating seed data for user: 108	âœ…
Generating seed data for user: 130	âœ…
Generating seed data for user: 089	âœ…
Generating seed data for user: 042	âœ…
Generating seed data for user: 045	âœ…
Generating seed data for user: 087	âœ…
Generating seed data for user: 073	âœ…
Generating seed data for user: 074	âœ…
Generating seed data for user: 080	âœ…
Generating seed data for user: 020	âœ…
Generating seed data for user: 027	âœ…
Generating seed data for user: 018	âœ…
Generating seed data for user: 011	âœ…
Generating seed data for user: 016	âœ…
Generating seed data for user: 029	âœ…
Generating seed data for user: 081	âœ…
Generating seed data for user: 075	âœ…
Generating seed data for user: 072	âœ…
Generating seed data for user: 086	âœ…
Generating seed data for user: 044	âœ…
Generating seed data for user: 088	âœ…
Generating seed data for user: 043	âœ…
Generating seed data for user: 017	âœ…
Generating seed data for user: 028	âœ…
Generating seed data for user: 010	âœ…
Generating seed data for user: 026	âœ…
Generating seed data for user: 019	âœ…
Generating seed data for user: 021	âœ…
Generating seed data for user: 003	âœ…
Generating seed data for user: 004	âœ…
Generating seed data for user: 032	âœ…
Generating seed data for user: 035	âœ…
Generating seed data for user: 095	âœ…
Generating seed data for user: 061	âœ…
Generating seed data for user: 066	âœ…
Generating seed data for user: 092	âœ…
Generating seed data for user: 059	âœ…
Generating seed data for user: 050	âœ…
Generating seed data for user: 057	âœ…
Generating seed data for user: 068	âœ…
Generating seed data for user: 034	âœ…
Generating seed data for user: 033	âœ…
Generating seed data for user: 005	âœ…
Generating seed data for user: 002	âœ…
Generating seed data for user: 056	âœ…
Generating seed data for user: 069	âœ…
Generating seed data for user: 051	âœ…
Generating seed data for user: 093	âœ…
Generating seed data for user: 067	âœ…
Generating seed data for user: 058	âœ…
Generating seed data for user: 060	âœ…
Generating seed data for user: 094	âœ…
Generating seed data for user: 112	âœ…
Generating seed data for user: 115	âœ…
Generating seed data for user: 123	âœ…
Generating seed data for user: 124	âœ…
Generating seed data for user: 170	âœ…
Generating seed data for user: 177	âœ…
Generating seed data for user: 148	âœ…
Generating seed data for user: 141	âœ…
Generating seed data for user: 146	âœ…
Generating seed data for user: 179	âœ…
Generating seed data for user: 125	âœ…
Generating seed data for user: 122	âœ…
Generating seed data for user: 114	âœ…
Generating seed data for user: 113	âœ…
Generating seed data for user: 147	âœ…
Generating seed data for user: 178	âœ…
Generating seed data for user: 140	âœ…
Generating seed data for user: 176	âœ…
Generating seed data for user: 149	âœ…
Generating seed data for user: 171	âœ…
262144
[('135-20090103012134', 'Point(39.974294 116.399741)', '492', '39816.0566435185', '2009-01-03 01:21:34'), ('135-20090103012134', 'Point(39.974292 116.399592)', '492', '39816.0566550926', '2009-01-03 01:21:35'), ('135-20090103012134', 'Point(39.974309 116.399523)', '492', '39816.0566666667', '2009-01-03 01:21:36'), ('135-20090103012134', 'Point(39.97432 116.399588)', '492', '39816.0566898148', '2009-01-03 01:21:38'), ('135-20090103012134', 'Point(39.974365 116.39973)', '491', '39816.0567013889', '2009-01-03 01:21:39'), ('135-20090103012134', 'Point(39.974391 116.399782)', '491', '39816.0567361111', '2009-01-03 01:21:42'), ('135-20090103012134', 'Point(39.974426 116.399735)', '491', '39816.0567824074', '2009-01-03 01:21:46'), ('135-20090103012134', 'Point(39.974458 116.3997)', '491', '39816.0568402778', '2009-01-03 01:21:51'), ('135-20090103012134', 'Point(39.974491 116.399732)', '490', '39816.0568981481', '2009-01-03 01:21:56'), ('135-20090103012134', 'Point(39.97453 116.399758)', '489', '39816.0569560185', '2009-01-03 01:22:01'), ('135-20090103012134', 'Point(39.974577 116.399745)', '490', '39816.0569907407', '2009-01-03 01:22:04'), ('135-20090103012134', 'Point(39.974623 116.399731)', '491', '39816.057025463', '2009-01-03 01:22:07'), ('135-20090103012134', 'Point(39.974666 116.399713)', '491', '39816.0570601852', '2009-01-03 01:22:10'), ('135-20090103012134', 'Point(39.9747 116.399755)', '491', '39816.0570949074', '2009-01-03 01:22:13'), ('135-20090103012134', 'Point(39.974732 116.399838)', '491', '39816.0571412037', '2009-01-03 01:22:17'), ('135-20090103012134', 'Point(39.97473 116.399909)', '491', '39816.0571527778', '2009-01-03 01:22:18'), ('135-20090103012134', 'Point(39.974728 116.399982)', '491', '39816.0571643518', '2009-01-03 01:22:19'), ('135-20090103012134', 'Point(39.974731 116.400052)', '491', '39816.0571875', '2009-01-03 01:22:21'), ('135-20090103012134', 'Point(39.97473 116.400143)', '491', '39816.0571990741', '2009-01-03 01:22:22'), ('135-20090103012134', 'Point(39.974737 116.400205)', '491', '39816.0572222222', '2009-01-03 01:22:24')]
Seeding batch: 0 of 36	âœ…
Seeding batch: 1 of 36	âœ…
Seeding batch: 2 of 36	âœ…
Seeding batch: 3 of 36	âœ…
Seeding batch: 4 of 36	âœ…
Seeding batch: 5 of 36	âœ…
Seeding batch: 6 of 36	âœ…
Seeding batch: 7 of 36	âœ…
Seeding batch: 8 of 36	âœ…
Seeding batch: 9 of 36	âœ…
Seeding batch: 10 of 36	âœ…
Seeding batch: 11 of 36	âœ…
Seeding batch: 12 of 36	âœ…
Seeding batch: 13 of 36	âœ…
Seeding batch: 14 of 36	âœ…
Seeding batch: 15 of 36	âœ…
Seeding batch: 16 of 36	âœ…
Seeding batch: 17 of 36	âœ…
Seeding batch: 18 of 36	âœ…
Seeding batch: 19 of 36	âœ…
Seeding batch: 20 of 36	âœ…
Seeding batch: 21 of 36	âœ…
Seeding batch: 22 of 36	âœ…
Seeding batch: 23 of 36	âœ…
Seeding batch: 24 of 36	âœ…
Seeding batch: 25 of 36	âœ…
Seeding batch: 26 of 36	âœ…
Seeding batch: 27 of 36	âœ…
Seeding batch: 28 of 36	âœ…
Seeding batch: 29 of 36	âœ…
Seeding batch: 30 of 36	âœ…
Seeding batch: 31 of 36	âœ…
Seeding batch: 32 of 36	âœ…
Seeding batch: 33 of 36	âœ…
Seeding batch: 34 of 36	âœ…
Seeding batch: 35 of 36	âœ…
Seeding batch: 36 of 36	âœ…
Seeded [(9681756,)] TrackPoints
------------------Finished seed_track_points in 255735.785 ms-------------------

In [38]:
migrator.create_indices()

----------------------------Starting create_indices-----------------------------
Executing statement
 ALTER TABLE TrackPoints ADD INDEX datetime_idx (datetime); âœ…
--------------------Finished create_indices in 12093.948 ms---------------------

## Part 2

In [ ]:
tasks = t.Task(database)

### Task 1

In [ ]:
tasks.task1()

### Task 2

In [ ]:
tasks.task2()

### Task 3

In [ ]:
tasks.task3()

### Task 4

In [ ]:
tasks.task4()

### Task 5

In [ ]:
tasks.task5()

### Task 7

In [ ]:
tasks.task7a()

In [ ]:
tasks.task7b()

### Task 8

In [ ]:
tasks.task8()

In [ ]:
# query = """
#     SELECT DISTINCT left.user_id AS UserID1, right.user_id AS UserID2
#     FROM full AS left
#     INNER JOIN full AS right
#         ON left.user_id != right.user_id
#         AND left.datetime <= right.datetime
#         AND MBRContains(ST_BUFFER(left.geom, 50), right.geom)
#         AND TIME_TO_SEC(TIMEDIFF(right.datetime, left.datetime)) <= 30
# """



query = """
SELECT DISTINCT p1.user_id as UserID1, p2.user_id AS UserID2
FROM full AS p1
INNER JOIN full AS p2
    ON p1.user_id != p2.user_id
LIMIT 10
"""

database.query(query)

In [ ]:
database.cursor.fetchall()

In [ ]:
left_table = """
    CREATE TEMPORARY TABLE p1 AS
        SELECT u.id as user_id, tp.datetime as datetime, tp.geom as geom
        FROM TrackPoints as tp
        INNER JOIN Activities as a
            ON a.id = tp.activity_id
        INNER JOIN Users as u
            on u.id = a.user_id
"""
database.query(left_table)

In [ ]:
right_table = """
    CREATE TEMPORARY TABLE p2 AS
        SELECT u.id as user_id, tp.datetime as datetime, tp.geom as geom
        FROM TrackPoints as tp
        INNER JOIN Activities as a
            ON a.id = tp.activity_id
        INNER JOIN Users as u
            on u.id = a.user_id
"""
database.query(right_table)

In [ ]:
query = """
SELECT DISTINCT a1.user_id, a2.user_id
FROM Activities a1
JOIN TrackPoints tp1 ON a1.id = tp1.activity_id
JOIN Activities a2 ON a1.user_id != a2.user_id
JOIN TrackPoints tp2 ON a2.id = tp2.activity_id
WHERE a1.start_datetime <= a2.end_datetime
AND a1.end_datetime >= a2.start_datetime
AND ST_Distance_Sphere(tp1.geom, tp2.geom) <= 50
AND ABS(TIMESTAMPDIFF(SECOND, tp1.datetime, tp2.datetime)) <= 30
"""

database.query(query)

In [12]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;
"""

database.query(query)

Running statement:

WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;

Query Finished

    user_id
0       000
1       001
2       002
3       003
4       004
..      ...
142     166
143     171
144     152
145     139
146     168

[147 rows x 1 columns]

In [18]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
        JOIN TrackPoints p1 ON p1.activity_id = a1.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;
"""

database.query(query)

Running statement:

WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
        JOIN TrackPoints p1 ON p1.activity_id = a1.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;

Query Finished

    user_id
0       000
1       001
2       002
3       003
4       004
..      ...
142     166
143     171
144     152
145     139
146     168

[147 rows x 1 columns]

In [19]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
        JOIN TrackPoints p2 ON p2.activity_id = a2.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;
"""

database.query(query)

Running statement:

WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
        JOIN TrackPoints p2 ON p2.activity_id = a2.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;

Query Finished

    user_id
0       000
1       001
2       002
3       003
4       004
..      ...
142     166
143     171
144     152
145     139
146     168

[147 rows x 1 columns]

In [20]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
    JOIN TrackPoints p1 ON p1.activity_id = a1.id
    JOIN TrackPoints p2 ON p2.activity_id = a2.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;
"""

database.query(query)

Running statement:

WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        AND a1.user_id < a2.user_id
    JOIN TrackPoints p1 ON p1.activity_id = a1.id
    JOIN TrackPoints p2 ON p2.activity_id = a2.id
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;

Query Finished

    user_id
0       000
1       001
2       002
3       003
4       004
..      ...
142     166
143     171
144     152
145     139
146     168

[147 rows x 1 columns]

In [39]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    -- Make a combination of all activities
    JOIN Activities a2 ON a1.id < a2.id
        -- We restrict the search space to activities that overlap with a 30 second margin
        -- to limit the number of track point comparisons that we have to perform.
        -- Activities that do not overlap within at least a 30 second margin
        -- should not contain track points that are within 30 seconds of each other.
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        -- Avoid comparing a user to themselves
        AND a1.user_id < a2.user_id
    -- Join in the track points on the two sets of activities
    JOIN TrackPoints p1 ON p1.activity_id = a1.id
    JOIN TrackPoints p2 ON p2.activity_id = a2.id
    -- Then, after restricting the search space, we check for
    -- track points that are close both in time
    WHERE ABS(TIME_TO_SEC(TIMEDIFF(p1.datetime, p2.datetime))) <= 30
    -- and in space
    AND ST_Distance_Sphere(p1.geom, p2.geom) <= 50
)
-- Finally, we select the list of distinct user_ids of users
-- who have been near other users in space and time
SELECT DISTINCT user_id
FROM (
    -- Combine the two columns of user ID pairs into a single column of user IDs
    -- to find the total count of unique users who have been near others
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids
-- Order the results by ascending ID
ORDER BY user_id ASC;
"""

database.query(query)

Running statement:

WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        -- We restrict the search space to activities that overlap with a 30 second margin
        -- to limit the number of track point comparisons that we have to perform.
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        -- Avoid comparing a user to themselves
        AND a1.user_id < a2.user_id
    JOIN TrackPoints p1 ON p1.activity_id = a1.id
    JOIN TrackPoints p2 ON p2.activity_id = a2.id
    -- Then, after restricting the search space, we check for
    -- track points that are close both in time and space
    WHERE ABS(TIME_TO_SEC(TIMEDIFF(p1.datetime, p2.datetime))) <= 30
    AND ST_Distance_Sphere(p1.geom, p2.geom) <= 50
)
-- Finally, we select the list of distinct user_ids of users
-- who have been near other users in space and time
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids
ORDER BY user_id ASC;

Query Finished

    user_id
0       000
1       001
2       003
3       004
4       005
..      ...
116     173
117     174
118     175
119     176
120     179

[121 rows x 1 columns]

In [ ]:
query = """
WITH user_pairs AS (
    SELECT DISTINCT a1.user_id AS user_id1, a2.user_id AS user_id2
    FROM Activities a1
    JOIN Activities a2 ON a1.id < a2.id
        -- We restrict the search space to activities that overlap with a 30 second margin
        -- to limit the number of track point comparisons that we have to perform.
        AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
        AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
        -- Avoid comparing a user to themselves
        AND a1.user_id < a2.user_id
    JOIN TrackPoints p1 ON p1.activity_id = a1.id
    JOIN TrackPoints p2 ON p2.activity_id = a2.id
    WHERE ABS(TIME_TO_SEC(TIMEDIFF(p1.datetime, p2.datetime))) <= 30
)
SELECT DISTINCT user_id
FROM (
    SELECT user_id1 AS user_id FROM user_pairs
    UNION
    SELECT user_id2 FROM user_pairs
) AS user_ids;
"""

database.query(query)

In [23]:
query = """
SELECT DISTINCT p1.id, p2.id
FROM Activities a1
JOIN Activities a2 ON a1.id < a2.id
    AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
    AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
    AND a1.user_id < a2.user_id
JOIN TrackPoints p1 ON p1.activity_id = a1.id
JOIN TrackPoints p2 ON p2.activity_id = a2.id
"""

database.query(query)

Running statement:

SELECT DISTINCT p1.id, p2.id
FROM Activities a1
JOIN Activities a2 ON a1.id < a2.id
    AND TIME_TO_SEC(TIMEDIFF(a2.start_datetime, a1.end_datetime)) <= 30
    AND TIME_TO_SEC(TIMEDIFF(a1.start_datetime, a2.end_datetime)) <= 30
    AND a1.user_id < a2.user_id
JOIN TrackPoints p1 ON p1.activity_id = a1.id
JOIN TrackPoints p2 ON p2.activity_id = a2.id

Query Finished

                id       id
0              911  1063368
1              911  1063369
2              911  1063370
3              911  1063371
4              911  1063372
...            ...      ...
213598906  1962424   688266
213598907  1962424   688267
213598908  1962424   688268
213598909  1962424   688269
213598910  1962424   688270

[213598911 rows x 2 columns]

In [41]:
task_8_result = _

In [42]:
task_8_result

    user_id
0       000
1       001
2       003
3       004
4       005
..      ...
116     173
117     174
118     175
119     176
120     179

[121 rows x 1 columns]

In [44]:
task_8_result.all()

user_id    True
dtype: bool

In [49]:
with pd.option_context("display.max_rows", None):
    display(task_8_result)

    user_id
0       000
1       001
2       003
3       004
4       005
5       006
6       007
7       008
8       009
9       010
10      011
11      012
12      013
13      014
14      015
15      016
16      017
17      018
18      019
19      020
20      022
21      023
22      024
23      025
24      028
25      029
26      030
27      032
28      034
29      035
30      036
31      037
32      038
33      039
34      041
35      042
36      043
37      044
38      045
39      046
40      047
41      051
42      052
43      055
44      056
45      057
46      058
47      059
48      061
49      062
50      064
51      067
52      068
53      069
54      070
55      071
56      073
57      074
58      075
59      076
60      078
61      081
62      082
63      083
64      084
65      085
66      087
67      088
68      089
69      091
70      092
71      093
72      094
73      095
74      096
75      100
76      101
77      102
78      104
79      105
80      106
81      108
82      109
83      110
84      111
85      112
86      113
87      114
88      115
89      116
90      117
91      124
92      125
93      126
94      127
95      128
96      129
97      134
98      136
99      139
100     140
101     142
102     144
103     150
104     153
105     155
106     157
107     159
108     161
109     162
110     163
111     164
112     165
113     167
114     169
115     170
116     173
117     174
118     175
119     176
120     179

In [110]:
track_points_of_interest = database.query(
    """
        SELECT id
        FROM TrackPoints
        WHERE activity_id IN (
            SELECT a1.id AS id
            FROM Activities a1
            WHERE EXISTS (
                SELECT 1
                FROM Activities a2
                WHERE a2.start_datetime <= a1.end_datetime + INTERVAL 30 SECOND
                AND a2.end_datetime >= a1.start_datetime - INTERVAL 30 SECOND
                AND a1.id < id
                AND a1.user_Id < user_id
            )
        )
        ORDER BY id;
    """
)

Running statement:

        SELECT id, activity_id, datetime, ST_LATITUDE(geom) as latitude, ST_LONGITUDE(geom) AS longitude
        FROM TrackPoints
        WHERE activity_id IN (
            SELECT a1.id AS id
            FROM Activities a1
            WHERE EXISTS (
                SELECT 1
                FROM Activities a2
                WHERE a2.start_datetime <= a1.end_datetime + INTERVAL 30 SECOND
                AND a2.end_datetime >= a1.start_datetime - INTERVAL 30 SECOND
                AND a1.id < id
                AND a1.user_Id < user_id
            )
        )
        ORDER BY id;

Query Finished

In [111]:
track_points_of_interest

,id,activity_id,datetime,latitude,longitude
0,1,135-20090103012134,2009-01-03 01:21:34,39.974294,116.399741
1,2,135-20090103012134,2009-01-03 01:21:35,39.974292,116.399592
2,3,135-20090103012134,2009-01-03 01:21:36,39.974309,116.399523
3,4,135-20090103012134,2009-01-03 01:21:38,39.974320,116.399588
4,5,135-20090103012134,2009-01-03 01:21:39,39.974365,116.399730
...,...,...,...,...,...
5927774,9681391,176-20071208013029,2007-12-08 03:13:54,39.971000,116.304200
5927775,9681392,176-20071208013029,2007-12-08 03:15:01,39.971100,116.304933
5927776,9681393,176-20071208013029,2007-12-08 03:15:54,39.970817,116.304250
5927777,9681394,176-20071208013029,2007-12-08 03:16:57,39.970867,116.303250
5927778,9681395,176-20071208013029,2007-12-08 03:17:35,39.970983,116.305600

In [141]:
import multiprocessing
from multi import get_id_pairs

In [131]:


processes = 11
pool = multiprocessing.Pool(processes)
batch_size = track_points_of_interest.shape[0] // processes

In [132]:
def get_batch_ids(batch_idx, batch_size, df, database):
    current_batch = df.iloc[batch_size * batch_idx: batch_size * (batch_idx + 1)]
    first, last = current_batch.iloc[[0, -1]]["id"]
    return database, first, last, first, last

batch_input = [get_batch_ids(i, batch_size, track_points_of_interest, database) for i in range(processes)]

In [140]:
results = pool.map(get_id_pairs, batch_input)

AttributeError: Can't pickle local object 'make_get_id_pairs.<locals>.get_id_pairs'

In [130]:
batch_input

[(1, 1085465, 1, 1085465),
 (1085466, 1677769, 1085466, 1677769),
 (1677770, 2374860, 1677770, 2374860),
 (2374861, 3067020, 2374861, 3067020),
 (3067021, 3652122, 3067021, 3652122),
 (3652123, 4597806, 3652123, 4597806),
 (4597807, 6632630, 4597807, 6632630),
 (6632631, 7535069, 6632631, 7535069),
 (7535070, 8107145, 7535070, 8107145),
 (8107146, 8771418, 8107146, 8771418),
 (8771419, 9681395, 8771419, 9681395)]

In [81]:
batch_size

493981

In [75]:
get_id_pairs((3021481, 3021482, 3021481, 3021482))

Running statement:

        WITH acts AS (
            SELECT a1.id AS id, a1.user_id AS user_id
            FROM Activities a1
            WHERE EXISTS (
                SELECT 1
                FROM Activities a2
                WHERE a2.start_datetime <= a1.end_datetime + INTERVAL 30 SECOND
                AND a2.end_datetime >= a1.start_datetime - INTERVAL 30 SECOND
                AND a1.id < id
                AND a1.user_Id < user_id
            )
        ),
        batch_track_points AS (
            SELECT id, activity_id, datetime, geom
            FROM TrackPoints
            WHERE activity_id IN (
                SELECT id
                FROM acts
            )
            AND id BETWEEN %s AND %s
        ),
        track_points_of_interest AS (
            SELECT id, activity_id, datetime, geom
            FROM TrackPoints
            WHERE activity_id IN (
                SELECT id
                FROM acts
            )
            AND id NOT BETWEEN %s AND %s
            LIMIT 500
        )
        SELECT a1.user_id, a2.user_id
        FROM acts a1
        JOIN acts a2 ON a1.id < a2.id
        AND a1.user_id != a2.user_id
        JOIN batch_track_points p1 ON p1.activity_id = a1.id
        JOIN track_points_of_interest p2 ON p1.id < p2.id
        AND p1.activity_id != p2.activity_id
        AND ABS(TIME_TO_SEC(TIMEDIFF(p1.datetime, p2.datetime))) <= 30
        AND ST_Distance_Sphere(p1.geom, p2.geom) <= 50

Query Finished

Empty DataFrame
Columns: [user_id, user_id]
Index: []